# RbsPipeFluidTemperatureParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeFluidTemperatureParam Property
ParameterTypeId Class See Also
---
"Fluid Temperature"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeFluidTemperatureParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeFluidTemperatureParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeFluidTemperatureParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace